In [1]:
import numpy as np
import pandas as pd

from numpy.random import randn

In [2]:
df = pd.DataFrame(randn(4,3),["A","B","C","D"],["Column1","Column2","Column3"])

In [3]:
df

    Column1   Column2   Column3
A -1.020195  0.678597  0.743173
B  2.024726  0.078171  0.472666
C -0.131509 -0.004306 -0.603115
D -1.397157 -0.811020  0.301037

In [4]:
df > -1

   Column1  Column2  Column3
A    False     True     True
B     True     True     True
C     True     True     True
D    False     True     True

In [5]:
boolDf = df > -1

In [6]:
boolDf

   Column1  Column2  Column3
A    False     True     True
B     True     True     True
C     True     True     True
D    False     True     True

In [7]:
df[boolDf]

    Column1   Column2   Column3
A       NaN  0.678597  0.743173
B  2.024726  0.078171  0.472666
C -0.131509 -0.004306 -0.603115
D       NaN -0.811020  0.301037

In [11]:
df[df > 0]

    Column1   Column2   Column3
A       NaN  0.678597  0.743173
B  2.024726  0.078171  0.472666
C       NaN       NaN       NaN
D       NaN       NaN  0.301037

In [13]:
df

    Column1   Column2   Column3
A -1.020195  0.678597  0.743173
B  2.024726  0.078171  0.472666
C -0.131509 -0.004306 -0.603115
D -1.397157 -0.811020  0.301037

In [14]:
df["Column1"]

A   -1.020195
B    2.024726
C   -0.131509
D   -1.397157
Name: Column1, dtype: float64

In [15]:
df["Column1"] > -1

A    False
B     True
C     True
D    False
Name: Column1, dtype: bool

In [16]:
df[df["Column1"] > -1]

    Column1   Column2   Column3
B  2.024726  0.078171  0.472666
C -0.131509 -0.004306 -0.603115

In [17]:
df

    Column1   Column2   Column3
A -1.020195  0.678597  0.743173
B  2.024726  0.078171  0.472666
C -0.131509 -0.004306 -0.603115
D -1.397157 -0.811020  0.301037

In [18]:
df["Column3"] < 0

A    False
B    False
C     True
D    False
Name: Column3, dtype: bool

In [19]:
df[df["Column3"] < 0]

    Column1   Column2   Column3
C -0.131509 -0.004306 -0.603115

In [20]:
df["Column1"] > -1

A    False
B     True
C     True
D    False
Name: Column1, dtype: bool

In [21]:
df["Column3"] > 0

A     True
B     True
C    False
D     True
Name: Column3, dtype: bool

In [22]:
df[df["Column1"] > -1]

    Column1   Column2   Column3
B  2.024726  0.078171  0.472666
C -0.131509 -0.004306 -0.603115

In [23]:
df[df["Column3"] > 0]

    Column1   Column2   Column3
A -1.020195  0.678597  0.743173
B  2.024726  0.078171  0.472666
D -1.397157 -0.811020  0.301037

In [25]:
df[(df["Column1"] > -1) & (df["Column3"] > 0)]

    Column1   Column2   Column3
B  2.024726  0.078171  0.472666

In [28]:
df[(df["Column1"] > -1) | (df["Column3"] > 0)]

    Column1   Column2   Column3
A -1.020195  0.678597  0.743173
B  2.024726  0.078171  0.472666
C -0.131509 -0.004306 -0.603115
D -1.397157 -0.811020  0.301037

#### DataFrame'e Yeni Sütun Ekleme Yöntemleri

#### 1. Yöntem

In [29]:
df

    Column1   Column2   Column3
A -1.020195  0.678597  0.743173
B  2.024726  0.078171  0.472666
C -0.131509 -0.004306 -0.603115
D -1.397157 -0.811020  0.301037

In [48]:
df["Column4"] = pd.Series(randn(4),index = ["A","B","C","D"])

In [49]:
df

    Column1   Column2   Column3   Column4
A -1.020195  0.678597  0.743173  0.947703
B  2.024726  0.078171  0.472666 -0.808056
C -0.131509 -0.004306 -0.603115  0.802755
D -1.397157 -0.811020  0.301037  0.000195

#### 2.Yöntem

In [54]:
df["Column5"] = randn(4)

In [55]:
df

    Column1   Column2   Column3   Column4   Column5
A -1.020195  0.678597  0.743173  0.947703  0.240125
B  2.024726  0.078171  0.472666 -0.808056  0.031368
C -0.131509 -0.004306 -0.603115  0.802755  0.420555
D -1.397157 -0.811020  0.301037  0.000195 -0.724746

### Set Index ve Indeksi Değiştirme

In [56]:
df

    Column1   Column2   Column3   Column4   Column5
A -1.020195  0.678597  0.743173  0.947703  0.240125
B  2.024726  0.078171  0.472666 -0.808056  0.031368
C -0.131509 -0.004306 -0.603115  0.802755  0.420555
D -1.397157 -0.811020  0.301037  0.000195 -0.724746

In [57]:
df["Column6"] = ["newValue1","newValue2","newValue3","newValue4"]

In [58]:
df

    Column1   Column2   Column3   Column4   Column5    Column6
A -1.020195  0.678597  0.743173  0.947703  0.240125  newValue1
B  2.024726  0.078171  0.472666 -0.808056  0.031368  newValue2
C -0.131509 -0.004306 -0.603115  0.802755  0.420555  newValue3
D -1.397157 -0.811020  0.301037  0.000195 -0.724746  newValue4

In [59]:
df.set_index("Column6")

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1 -1.020195  0.678597  0.743173  0.947703  0.240125
newValue2  2.024726  0.078171  0.472666 -0.808056  0.031368
newValue3 -0.131509 -0.004306 -0.603115  0.802755  0.420555
newValue4 -1.397157 -0.811020  0.301037  0.000195 -0.724746

In [61]:
df # Değişikliği geçerli yapmak için inplace parametresi gerekir.

    Column1   Column2   Column3   Column4   Column5    Column6
A -1.020195  0.678597  0.743173  0.947703  0.240125  newValue1
B  2.024726  0.078171  0.472666 -0.808056  0.031368  newValue2
C -0.131509 -0.004306 -0.603115  0.802755  0.420555  newValue3
D -1.397157 -0.811020  0.301037  0.000195 -0.724746  newValue4

In [62]:
df.set_index("Column6",inplace = True)

In [63]:
df

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1 -1.020195  0.678597  0.743173  0.947703  0.240125
newValue2  2.024726  0.078171  0.472666 -0.808056  0.031368
newValue3 -0.131509 -0.004306 -0.603115  0.802755  0.420555
newValue4 -1.397157 -0.811020  0.301037  0.000195 -0.724746

In [65]:
df.index.names # Indekslerin ismi

FrozenList(['Column6'])